app/controllers/posts_controller.rb

INSERT INTO "authors" ("name", "hometown", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "John Grisham"], ["hometown", "Charlottesville, VA"], ["created_at", "2019-01-12 17:10:56.816635"], ["updated_at", "2019-01-12 17:10:56.816635"]]
---
  def index
    Author.create(name: "John Grisham", hometown: "Charlottesville, VA")