app/controllers/posts_controller.rb

INSERT INTO "authors" ("name", "hometown", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "John Grisham"], ["hometown", "Charlottesville, VA"], ["created_at", "2019-01-12 17:05:57.565404"], ["updated_at", "2019-01-12 17:05:57.565404"]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    # binding.pry
    Author.create(name: "John Grisham", hometown: "Charlottesville, VA")
    @post = Post.find(params[:id])

SELECT  "authors".* FROM "authors"  ORDER BY "authors"."id" ASC LIMIT 1
INSERT INTO "posts" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["author_id", 1], ["created_at", "2019-01-12 16:53:56.807225"], ["updated_at", "2019-01-12 16:53:56.807225"]]
---
  def create
    @author = Author.first
    @post = Post.new
    @post.title = params[:title]
    @post.description = params[:description]
    @post.author_id = @author.id
    @post.save